# Дано положительное действительное число X. Выведите его дробную часть.
X = float(input())

print(X - int(X))
