# N школьников делят K яблок поровну, не делящийся остаток остается в корзинке.
# Сколько яблок достанется каждому школьнику?
# Программа получает на вход числа N и K — натуральные, не превышают 10000.
N = input()
K = input()
print(int((int(K)/int(N))))
