# Дано натуральное число. Выведите его последнюю цифру.
# Вводится единственное целое положительное число (гарантируется, что оно не превышает 10000).
N = input()
print(N[-1])
