# Дана строка. Удалите из этой строки все символы @.

s = input()

print(s.replace('@', ''))
