# Дано трехзначное число. Найдите сумму его цифр.
# Вводится целое положительное число. Гарантируется, что оно соответствует условию задачи.
N = input()
print(int(N[0])+int(N[1])+int(N[2]))
